// Напишите программу, которая отобразит ваше имя и адрес.

#include <iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "rus");
    cout << "Имя: Юрий" << endl;
    cout << "Адрес: Нижневартовск ул. Х-Мансийская" << endl;
    return 0;
}